src/Reports/УнифицированнаяФормаП50СКД/УнифицированнаяФормаП50СКД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>УнифицированнаяФормаП50СКД</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СамостоятельнаяНастройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохраненныеНастройки</name>
  </attributes>
</mdclass:Report>

src/Enums/КодыОперацийВзаиморасчетыСРаботникамиОрганизаций/КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийВзаиморасчетыСРаботникамиОрганизаций</name>
  <enumValues>
    <name>Начисления</name>
  </enumValues>
  <enumValues>
    <name>Взносы</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>Удержания</name>
  </enumValues>
  <enumValues>
    <name>Займы</name>
  </enumValues>
  <enumValues>
    <name>Выплата</name>
  </enumValues>
  <enumValues>
    <name>ПереносОстатковНаСледующийМесяц</name>
  </enumValues>
  <enumValues>
    <name>ПереносОстатковСПредыдущегоМесяца</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыЗанятостиВОрганизации/ВидыЗанятостиВОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗанятостиВОрганизации</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>ОсновноеМестоРаботы</name>
  </enumValues>
  <enumValues>
    <name>Совместительство</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееСовместительство</name>
  </enumValues>
</mdclass:Enum>

src/ChartsOfCalculationTypes/ОсновныеНачисленияОрганизаций/ОсновныеНачисленияОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ОсновныеНачисленияОрганизаций</name>
  <comment>(Регл)</comment>
  <baseCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисленияОрганизаций</baseCalculationTypes>
  <predefined>
    <items>
      <name>УдалитьПростойОкладПоДням</name>
      <description>(Не использовать) Оплата простоя от оклада по дням</description>
    </items>
    <items>
      <name>УдалитьПростойОкладПоЧасам</name>
      <description>(Не использовать) Оплата простоя от оклада по часам</description>
    </items>
    <items>
      <name>УдалитьПростойТарифДневной</name>
      <description>(Не использовать) Оплата простоя по дневному тарифу</description>
    </items>
    <items>
      <name>АвторскоеВознаграждение</name>
      <description>Авторское вознаграждение</description>
    </items>
    <items>
      <name>ОплатаБЛПоТравмеВБыту</name>
      <description>БЛ по травме в быту (не оплачивается)</description>
    </items>
    <items>
      <name>БлаготворительнаяПомощь</name>
      <description>Благотворительная помощь</description>
    </items>
    <items>
      <name>ВыслугаЛет</name>
      <description>Выслуга лет</description>
    </items>
    <items>
      <name>ВыслугаЛетЕжемесячно</name>
      <description>Выслуга лет ежемесячно</description>
    </items>
    <items>
      <name>ВыходноеПособие</name>
      <description>Выходное пособие</description>
    </items>
    <items>
      <name>Годовая</name>
      <description>Годовая</description>
    </items>
    <items>
      <name>ДивидендыАкционеров</name>
      <description>Дивиденды акционеров</description>
    </items>
    <items>
      <name>ДивидендыРаботников</name>
      <description>Дивиденды работников</description>
    </items>
    <items>
      <name>ДниНеоплачиваемыеСогласноТабелю</name>
      <description>Дни неоплачиваемые согласно табелю</description>
    </items>
    <items>
      <name>ДоговорПодряда</name>
      <description>Договор подряда</description>
    </items>
    <items>
      <name>ДоговорПодрядаСПД</name>
      <description>Договор подряда (для СПД)</description>
    </items>
    <items>
      <name>ДоплатаДоСреднего</name>
      <description>Доплата до среднего</description>
    </items>
    <items>
      <name>ДоплатаЗаВечерниеЧасы</name>
      <description>Доплата за вечерние часы</description>
    </items>
    <items>
      <name>ДоплатаЗаНочныеЧасы</name>
      <description>Доплата за ночные часы</description>
    </items>
    <items>
      <name>ДоплатаЗаПраздничныеИВыходные</name>
      <description>Доплата за работу в праздники и выходные</description>
    </items>
    <items>
      <name>ДополнительныйЕжегодныйОтпуск</name>
      <description>Дополнительный ежегодный отпуск</description>
    </items>
    <items>
      <name>ДополнительныйОтпускНаДетей</name>
      <description>Дополнительный отпуск на детей</description>
    </items>
    <items>
      <name>Замещение</name>
      <description>Замещение</description>
    </items>
    <items>
      <name>ИндексацияЗарплаты</name>
      <description>Индексация зарплаты</description>
    </items>
    <items>
      <name>ИндексацияСоцстрах</name>
      <description>Индексация соцстрах</description>
    </items>
    <items>
      <name>ИндексацияСоцстрахНесч</name>
      <description>Индексация соцстрах несч</description>
    </items>
    <items>
      <name>Квартальная</name>
      <description>Квартальная</description>
    </items>
    <items>
      <name>КомпенсацияЗарплаты</name>
      <description>Компенсация зарплаты</description>
    </items>
    <items>
      <name>КомпенсацияОтпуска</name>
      <description>Компенсация отпуска</description>
    </items>
    <items>
      <name>КомпенсацияПодотчетныхДС</name>
      <description>Компенсация подотчетных ДС</description>
    </items>
    <items>
      <name>Месячная</name>
      <description>Месячная</description>
    </items>
    <items>
      <name>ОкладПоДням</name>
      <description>Оклад по дням</description>
    </items>
    <items>
      <name>ОкладПоЧасам</name>
      <description>Оклад по часам</description>
    </items>
    <items>
      <name>ОплатаБЛПоТравмеНаПроизводстве</name>
      <description>Оплата БЛ по травме на производстве</description>
    </items>
    <items>
      <name>ОплатаПоСреднемуБЛ</name>
      <description>Оплата больничных листов</description>
    </items>
    <items>
      <name>ОплатаПоСреднемуБЛОрганизации</name>
      <description>Оплата больничных листов (первые 5 дней)</description>
    </items>
    <items>
      <name>ОплатаПоСреднемуОтп</name>
      <description>Оплата отпуска</description>
    </items>
    <items>
      <name>ТарифДневной</name>
      <description>Оплата по дневному тарифу</description>
    </items>
    <items>
      <name>СдельнаяОплата</name>
      <description>Оплата по производственным нарядам</description>
    </items>
    <items>
      <name>ОплатаПоСреднему</name>
      <description>Оплата по среднему заработку</description>
    </items>
    <items>
      <name>ТарифЧасовой</name>
      <description>Оплата по часовому тарифу</description>
    </items>
    <items>
      <name>ПочасовойПростой</name>
      <description>Оплата почасового простоя (не по вине работника)</description>
    </items>
    <items>
      <name>ПочасовойПростойПоСредней</name>
      <description>Оплата почасового простоя (по средней)</description>
    </items>
    <items>
      <name>ОплатаПраздничныхИВыходных</name>
      <description>Оплата праздничных и выходных дней</description>
    </items>
    <items>
      <name>Простой</name>
      <description>Оплата простоя (не по вине работника)</description>
    </items>
    <items>
      <name>ПростойПоСредней</name>
      <description>Оплата простоя (по средней)</description>
    </items>
    <items>
      <name>ОплатаСверхурочных</name>
      <description>Оплата сверхурочных часов</description>
    </items>
    <items>
      <name>ОтпускЗаСвойСчет</name>
      <description>Отпуск за свой счет</description>
    </items>
    <items>
      <name>ОтпускЗаСвойСчетПоСоглашению</name>
      <description>Отпуск за свой счет по соглашению сторон</description>
    </items>
    <items>
      <name>ОтпускПоБеременностиИРодам</name>
      <description>Отпуск по беременности и родам</description>
    </items>
    <items>
      <name>ОтпускПоУходуЗаРебенкомБезОплаты</name>
      <description>Отпуск по уходу за ребенком без оплаты</description>
    </items>
    <items>
      <name>НевыходРегл</name>
      <description>Отсутствие по невыясненной причине</description>
    </items>
    <items>
      <name>НаПогребение</name>
      <description>Помощь на погребение</description>
    </items>
    <items>
      <name>ПриРожденииРебенка</name>
      <description>Помощь при рождении ребенка</description>
    </items>
    <items>
      <name>ПособиеПоУходуЗаРебенкомДо3Лет</name>
      <description>Пособие по уходу за ребёнком до 3 лет</description>
    </items>
    <items>
      <name>Прогул</name>
      <description>Прогул, простой по вине работника</description>
    </items>
    <items>
      <name>СдельнаяОплатаГПХ</name>
      <description>Сдельная оплата ГПХ</description>
    </items>
    <items>
      <name>Совмещение</name>
      <description>Совмещение</description>
    </items>
    <items>
      <name>СтажВДнях</name>
      <description>Стаж в днях</description>
    </items>
    <items>
      <name>СтажВЧасах</name>
      <description>Стаж в часах</description>
    </items>
    <items>
      <name>ВозвратОтпуска</name>
      <description>Удержание за использованный авансом отпуск</description>
    </items>
    <items>
      <name>УчебныйОтпуск</name>
      <description>Учебный отпуск</description>
    </items>
    <items>
      <name>ОтпускБезОплатыУчебный</name>
      <description>Учебный отпуск без оплаты</description>
    </items>
    <items>
      <name>ЧернобыльскийОтпуск</name>
      <description>Чернобыльский отпуск</description>
    </items>
  </predefined>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.СпособыРасчетаОплатыТруда</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗачетОтработанногоВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗачетНормыВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияВБухучете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоходНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыДоходовНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияРасчета</name>
    <type>
      <types>EnumRef.КатегорииРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СоциальнаяГруппа</name>
    <comment>Используется для расчета индексации</comment>
    <type>
      <types>EnumRef.СоциальныеГруппыНаселения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказателиВидовОплатыТруда</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗачетКалендарных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВремени</name>
    <type>
      <types>EnumRef.ВидыВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетВводаТарифногоРазряда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтажа</name>
    <type>
      <types>CatalogRef.ВидыСтажа</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСтажа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяДоходомВНатуральнойФорме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоМесяцев</name>
    <comment>Используется в расчете средней, для определения средней суммы премии за месяц</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОтпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаПоНазначению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеВТабелеУчетаРабочегоВремени</name>
    <type>
      <types>CatalogRef.КлассификаторИспользованияРабочегоВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИспользованияРабочегоВремени</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольнаяФормулаРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыРасчетов77</name>
    <comment>Используется для переноса из ЗИК 7.7</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтпуска</name>
    <type>
      <types>CatalogRef.ВидыОтпусков</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБольничные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НачислениеЗаСчетФСС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиСхемМотивации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрашиватьПриКадровыхПеремещениях</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCalculationTypes>

src/Reports/УнифицированнаяФормаП50СКД/ObjectModule.bsl
Процедура ЗаполнитьПараметры(Настройки = Неопределено, ЗаполнениеПоУмолчанию = Ложь) Экспорт
	//Сокращения
	Настройки = КомпоновщикНастроек.Настройки;
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;

	парамПериод = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	парамПериод.Значение = Период;
	парамПериод.Использование = Истина;
		
	начПериода =  ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("начПериода"));
	начПериода.Значение = НачалоМесяца(Период);
	начПериода.Использование = Истина;
		
	конПериода =  ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("конПериода"));
	конПериода.Значение = КонецМесяца(Период);
	конПериода.Использование = Истина;

	СледующийМесяц = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СледующийМесяц"));
	СледующийМесяц.Значение = КонецМесяца(Период) + 1;
	СледующийМесяц.Использование = Истина;
	
	
	Если Не СамостоятельнаяНастройка  ИЛИ ЗаполнениеПоУмолчанию Тогда		
		ОсновныеНачисления = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций;
		ВзносыВФонды = ПланыВидовРасчета.ВзносыВФонды;
		Удержания = ПланыВидовРасчета.УдержанияОрганизаций;
		
		
		//нараховано підрядно
		списокКолонка5 = Новый СписокЗначений;
		списокКолонка5.Добавить(ОсновныеНачисления.ДоговорПодряда);
		списокКолонка5.Добавить(ОсновныеНачисления.СдельнаяОплата);
		
		//нараховано почасово
		списокКолонка6 = Новый СписокЗначений;
		списокКолонка6.Добавить(ОсновныеНачисления.ОкладПоДням);
		списокКолонка6.Добавить(ОсновныеНачисления.ТарифЧасовой);
		списокКолонка6.Добавить(ОсновныеНачисления.ОкладПоЧасам);
		списокКолонка6.Добавить(ОсновныеНачисления.ТарифДневной);
		списокКолонка6.Добавить(ОсновныеНачисления.ОплатаПоСреднему);
		
		списокКолонка7 = Новый СписокЗначений;
		списокКолонка7.Добавить(ОсновныеНачисления.ПустаяСсылка());
		
		списокКолонка8 = Новый СписокЗначений;
		списокКолонка8.Добавить(ОсновныеНачисления.ПустаяСсылка());
		
		списокКолонка9 = Новый СписокЗначений;
		списокКолонка9.Добавить(ОсновныеНачисления.Квартальная);
		списокКолонка9.Добавить(ОсновныеНачисления.Месячная);
		списокКолонка9.Добавить(ОсновныеНачисления.Годовая);

		списокКолонка10 = Новый СписокЗначений;
		списокКолонка10.Добавить(ОсновныеНачисления.ПустаяСсылка());
		
		списокКолонка11 = Новый СписокЗначений;
		списокКолонка11.Добавить(ОсновныеНачисления.ДоплатаЗаВечерниеЧасы);
		списокКолонка11.Добавить(ОсновныеНачисления.ДоплатаЗаНочныеЧасы);
		
		списокКолонка12 = Новый СписокЗначений;
		списокКолонка12.Добавить(ОсновныеНачисления.ДоплатаЗаПраздничныеИВыходные);
		списокКолонка12.Добавить(ОсновныеНачисления.ОплатаСверхурочных);
		
		списокКолонка13 = Новый СписокЗначений;
		списокКолонка13.Добавить(ОсновныеНачисления.Простой);
		списокКолонка13.Добавить(ОсновныеНачисления.ПростойПоСредней);
		списокКолонка13.Добавить(ОсновныеНачисления.ПочасовойПростой);
		списокКолонка13.Добавить(ОсновныеНачисления.ПочасовойПростойПоСредней);
		
		списокКолонка14 = Новый СписокЗначений;
		списокКолонка14.Добавить(ОсновныеНачисления.ОплатаПоСреднемуОтп);
		списокКолонка14.Добавить(ОсновныеНачисления.ОтпускПоБеременностиИРодам);		
		
		списокКолонка16 = Новый СписокЗначений;
		списокКолонка16.Добавить(ОсновныеНачисления.ПустаяСсылка());
		
		списокКолонка17 = Новый СписокЗначений;
		списокКолонка17.Добавить(ОсновныеНачисления.ПустаяСсылка());
		
		списокКолонка18 = Новый СписокЗначений;
		списокКолонка18.Добавить(ОсновныеНачисления.ОплатаБЛПоТравмеВБыту);
		списокКолонка18.Добавить(ОсновныеНачисления.ОплатаПоСреднемуБЛ);
		списокКолонка18.Добавить(ОсновныеНачисления.ОплатаПоСреднемуБЛОрганизации);
		
		списокКолонка20 = Новый СписокЗначений;
		списокКолонка20.Добавить(ОсновныеНачисления.ПустаяСсылка());
		
		списокКолонка22 = Новый СписокЗначений;
		списокКолонка22.Добавить(Удержания.ПустаяСсылка());
		
		списокКолонка27 = Новый СписокЗначений;
		списокКолонка27.Добавить(Удержания.АлиментыПроцентом);
		списокКолонка27.Добавить(Удержания.АлиментыПроцентомДоПредела);
		списокКолонка27.Добавить(Удержания.АлиментыФиксированнойСуммой);
		списокКолонка27.Добавить(Удержания.АлиментыФиксированнойСуммойДоПредела);
		списокКолонка27.Добавить(Удержания.ИЛПроцентом);
		списокКолонка27.Добавить(Удержания.ИЛПроцентомДоПредела);
		списокКолонка27.Добавить(Удержания.ИЛФиксированнойСуммой);
		списокКолонка27.Добавить(Удержания.ИЛФиксированнойСуммойДоПредела);

		
		
		списокСчетаЗарплата = Новый СписокЗначений;
		списокСчетаЗарплата.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоЗаработнойПлате); //661
		списокСчетаЗарплата.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоДругимВыплатам); //663
		
		списокВыплаты = Новый СписокЗначений;
		списокВыплаты.Добавить(Перечисления.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.Выплата);
		
		списокОсновнойСотрудник = Новый СписокЗначений;
		списокОсновнойСотрудник.Добавить(Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы);
		списокОсновнойСотрудник.Добавить(Перечисления.ВидыЗанятостиВОрганизации.Совместительство);
				
		парамКолонка5 = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамКолонка5")); //Нараховано підрядно
		парамКолонка5.Значение = СписокКолонка5;
		парамКолонка5.Использование = Истина;
		
		парамКолонка6 = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамКолонка6")); //Нараховано почасово
		парамКолонка6.Значение = СписокКолонка6;
		парамКолонка6.Использование = Истина;
		
		парамКолонка7 = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамКолонка7")); //пустая колонка
		парамКолонка7.Значение = списокКолонка7;
		парамКолонка7.Использование = Истина;
		
		парамКолонка8 = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамКолонка8")); //пустая колонка
		парамКолонка8.Значение = списокКолонка8;
		парамКолонка8.Использование = Истина;
		
		парамКолонка9 = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамКолонка9"));
	    парамКолонка9.Значение = списокКолонка9;
		парамКолонка9.Использование = Истина;
		
		парамКолонка10 = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамКолонка10"));
		парамКолонка10.Значение = списокКолонка10;
		парамКолонка10.Использование = Истина;
		
		парамКолонка11 = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамКолонка11"));
		парамКолонка11.Значение = списокКолонка11;
		парамКолонка11.Использование = Истина;
		
		парамКолонка12 = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамКолонка12"));
		парамКолонка12.Значение = списокКолонка12;
		парамКолонка12.Использование = Истина;
		
		парамКолонка13 = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамКолонка13"));
		парамКолонка13.Значение = списокКолонка13;
		парамКолонка13.Использование = Истина;
		
		парамКолонка14 = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамКолонка14"));
		парамКолонка14.Значение = списокКолонка14;
		парамКолонка14.Использование = Истина;
		
		парамКолонка16 = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамКолонка16"));
		парамКолонка16.Значение = списокКолонка16;
		парамКолонка16.Использование = Истина;
		
		парамКолонка17 = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамКолонка17"));
		парамКолонка17.Значение = списокКолонка17;
		парамКолонка17.Использование = Истина;
		
		парамКолонка18 = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамКолонка18"));
		парамКолонка18.Значение = списокКолонка18;
		парамКолонка18.Использование = Истина;
		
		парамКолонка20= ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамКолонка20"));
		парамКолонка20.Значение = списокКолонка20;
		парамКолонка20.Использование = Истина;
		
       	парамКолонка22 = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамКолонка22"));
		парамКолонка22.Значение = списокКолонка22;
		парамКолонка22.Использование = Истина;
		
		парамКолонка27 = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамКолонка27"));
		парамКолонка27.Значение = списокКолонка27;
		парамКолонка27.Использование = Истина;
		
		парамВыплаты = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамКолонка30"));
		парамВыплаты.Значение = списокВыплаты;
		парамВыплаты.Использование = Истина;
		
		парамСчетаЗарплата = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамСчетаЗарплата"));
		парамСчетаЗарплата.Значение = списокСчетаЗарплата;
		парамСчетаЗарплата.Использование = Истина;

		парамОсновнойСотрудник = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамОсновнойСотрудник"));
		парамОсновнойСотрудник.Значение = списокОсновнойСотрудник;
		парамОсновнойСотрудник.Использование = Истина;
		
		парамВидДвиженияПриход = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамВидДвиженияПриход"));
		парамВидДвиженияПриход.Значение = ВидДвиженияНакопления.Приход;
		парамвидДвиженияПриход.Использование = Истина;
		
	//
	Иначе
	
		КомпоновщикНастроек.ЗагрузитьНастройки(ЭтотОбъект.СохраненныеНастройки);
	КонецЕсли;
	
КонецПроцедуры
